import { Link } from "react-router-dom";
import "../styles/footer.scss";

export const Footer = () => {
  return (
    <footer className="footer">
      <div className="footer__container">
        <div className="footer__top">
          <div className="footer__brand">
            <Link to="/" className="footer__logo">
              <svg
                width="45"
                height="42"
                viewBox="0 0 75 69"
                fill="none"
                xmlns="http://www.w3.org/2000/svg"
              >
                <path
                  d="M37.116 8.24168C36.9943 9.20765 36.8496 10.2215 36.6762 11.2614C36.1712 14.2902 35.4254 17.5552 34.3211 20.5123C33.2205 23.4599 31.7445 26.1549 29.7472 27.995C27.7484 29.8364 24.8619 31.1588 21.7196 32.1173C18.568 33.0787 15.1029 33.6907 11.8952 34.0808C11.7763 34.0953 11.6575 34.1086 11.5393 34.1225C11.6561 34.1354 11.7734 34.1482 11.8909 34.1618C15.0988 34.5314 18.5643 35.1228 21.7166 36.0688C24.8595 37.0121 27.7474 38.3243 29.7472 40.1666C31.7451 42.0073 33.221 44.7133 34.3214 47.6757C35.4255 50.6481 36.1713 53.9334 36.6762 56.9823C36.8495 58.0291 36.9943 59.0498 37.116 60.0224C37.2431 59.0489 37.3939 58.0271 37.573 56.9793C38.0943 53.9305 38.8565 50.6457 39.9728 47.6738C41.0854 44.7118 42.5693 42.0066 44.5665 40.1666C46.5659 38.3247 49.4451 37.0124 52.576 36.0691C55.7162 35.123 59.1655 34.5314 62.3573 34.1618C62.4743 34.1482 62.5911 34.1354 62.7074 34.1225C62.5896 34.1086 62.4714 34.095 62.353 34.0806C59.1614 33.6905 55.7125 33.0786 52.573 32.1171C49.4427 31.1585 46.5649 29.836 44.5665 27.995C42.5699 26.1555 41.0858 23.4613 39.973 20.5142C38.8566 17.5575 38.0943 14.2928 37.573 11.2642C37.3938 10.2233 37.2431 9.2085 37.116 8.24168ZM0.00493464 34.1624L0.00810592 34.7614L0.00277083 33.5633L0.00493464 34.1624Z"
                  fill="#e9e9e9"
                />
              </svg>
            </Link>
            <p className="footer__description">
              Уникальное веб-приложение для просмотра фильмов из общего доступа.
              Все фильмы доступны на YouTube и абсолютно бесплатны.
            </p>
          </div>

          <div className="footer__nav">
            <h3>Навигация</h3>
            <Link to="/">Главная</Link>
            <Link to="/recommendations">Рекомендации</Link>
            <Link to="/article">Памятка</Link>
            <Link to="/ds">Источники</Link>
          </div>
        </div>

        <div className="footer__divider" />

        <div className="footer__bottom">
          <p className="footer__copyright">
            © 2026 Vivian. Все права защищены.
          </p>
          
        </div>
      </div>
    </footer>
  );
};
